<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"bf5b6b94c0c5f4cef22b01173e03b6d5dfeeb01a6ca008814c8f0d7429f5f866","plan_job_ref":"Job Create Terraform plan (DEV) #67 at https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/14991908248","plan_out_hash":"effec82c3e0605aeae413bc21f70c09341e097433cee41929fa9365b79eba6ad","plan_hash":"c7e637c8d485a7027d598ef583bea8490177691a54a45a9d671531e55d2b2d59","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform/dev/__
<details>
<summary>Plan: 7 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # azurerm_federated_identity_credential.ESOFederatedIdentity will be created
+   resource "azurerm_federated_identity_credential" "ESOFederatedIdentity" {
+       audience            = [
+           "api://AzureADTokenExchange",
        ]
+       id                  = (known after apply)
+       issuer              = "https://francecentral.oic.prod-aks.azure.com/b7b023b8-7c32-4c02-92a6-c8cdaa1d189c/58a87291-fede-49bd-b321-c65582049b96/"
+       name                = "ESOFederatedIdentity"
+       parent_id           = "***************************************************************************************************************************************************************************************************************************************"
+       resource_group_name = "MC_rg-openmrscore-dev_openmrs-dev-audioprothese-aks_francecentral"
+       subject             = "system:serviceaccount:default:workload-identity-sa"
    }

  # azurerm_federated_identity_credential.LokiFederatedIdentity will be created
+   resource "azurerm_federated_identity_credential" "LokiFederatedIdentity" {
+       audience            = [
+           "api://AzureADTokenExchange",
        ]
+       id                  = (known after apply)
+       issuer              = "https://francecentral.oic.prod-aks.azure.com/b7b023b8-7c32-4c02-92a6-c8cdaa1d189c/58a87291-fede-49bd-b321-c65582049b96/"
+       name                = "LokiFederatedIdentity"
+       parent_id           = "***************************************************************************************************************************************************************************************************************************************"
+       resource_group_name = "MC_rg-openmrscore-dev_openmrs-dev-audioprothese-aks_francecentral"
+       subject             = "system:serviceaccount:loki:loki"
    }

  # azurerm_federated_identity_credential.identity will be destroyed
  # (because azurerm_federated_identity_credential.identity is not in configuration)
-   resource "azurerm_federated_identity_credential" "identity" {
-       audience            = [
-           "api://AzureADTokenExchange",
        ] -> null
-       id                  = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/MC_rg-openmrscore-dev_openmrs-dev-audioprothese-aks_francecentral/providers/Microsoft.ManagedIdentity/userAssignedIdentities/openmrs-dev-audioprothese-aks-agentpool/federatedIdentityCredentials/kubelet-federated-identity" -> null
-       issuer              = "https://francecentral.oic.prod-aks.azure.com/b7b023b8-7c32-4c02-92a6-c8cdaa1d189c/58a87291-fede-49bd-b321-c65582049b96/" -> null
-       name                = "kubelet-federated-identity" -> null
-       parent_id           = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/MC_rg-openmrscore-dev_openmrs-dev-audioprothese-aks_francecentral/providers/Microsoft.ManagedIdentity/userAssignedIdentities/openmrs-dev-audioprothese-aks-agentpool" -> null
-       resource_group_name = "MC_rg-openmrscore-dev_openmrs-dev-audioprothese-aks_francecentral" -> null
-       subject             = "system:serviceaccount:default:workload-identity-sa" -> null
    }

  # azurerm_kubernetes_cluster.aks will be updated in-place
!~  resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/b33703ee-cc2d-4e8b-bd23-c259839be42e/resourceGroups/rg-openmrscore-dev/providers/Microsoft.ContainerService/managedClusters/openmrs-dev-audioprothese-aks"
        name                                = "openmrs-dev-audioprothese-aks"
        tags                                = {
            "Environment"  = "dev"
            "organization" = "audioprothese"
            "project"      = "openmrs"
        }
#        (31 unchanged attributes hidden)

!~      default_node_pool {
            name                          = "default"
            tags                          = {}
#            (30 unchanged attributes hidden)

-           upgrade_settings {
-               drain_timeout_in_minutes      = 0 -> null
-               max_surge                     = "10%" -> null
-               node_soak_duration_in_minutes = 0 -> null
            }
        }

#        (4 unchanged blocks hidden)
    }

  # azurerm_role_assignment.loki will be created
+   resource "azurerm_role_assignment" "loki" {
+       condition_version                = (known after apply)
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = "************************************"
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "Storage Blob Data Contributor"
+       scope                            = (known after apply)
+       skip_service_principal_aad_check = true
    }

  # azurerm_storage_account.openmrscoredevsa02 will be created
+   resource "azurerm_storage_account" "openmrscoredevsa02" {
+       access_tier                        = (known after apply)
+       account_kind                       = "StorageV2"
+       account_replication_type           = "LRS"
+       account_tier                       = "Standard"
+       allow_nested_items_to_be_public    = true
+       cross_tenant_replication_enabled   = false
+       default_to_oauth_authentication    = false
+       dns_endpoint_type                  = "Standard"
+       https_traffic_only_enabled         = true
+       id                                 = (known after apply)
+       infrastructure_encryption_enabled  = false
+       is_hns_enabled                     = false
+       large_file_share_enabled           = (known after apply)
+       local_user_enabled                 = true
+       location                           = "francecentral"
+       min_tls_version                    = "TLS1_2"
+       name                               = "openmrscoredevsa02"
+       nfsv3_enabled                      = false
+       primary_access_key                 = (sensitive value)
+       primary_blob_connection_string     = (sensitive value)
+       primary_blob_endpoint              = (known after apply)
+       primary_blob_host                  = (known after apply)
+       primary_blob_internet_endpoint     = (known after apply)
+       primary_blob_internet_host         = (known after apply)
+       primary_blob_microsoft_endpoint    = (known after apply)
+       primary_blob_microsoft_host        = (known after apply)
+       primary_connection_string          = (sensitive value)
+       primary_dfs_endpoint               = (known after apply)
+       primary_dfs_host                   = (known after apply)
+       primary_dfs_internet_endpoint      = (known after apply)
+       primary_dfs_internet_host          = (known after apply)
+       primary_dfs_microsoft_endpoint     = (known after apply)
+       primary_dfs_microsoft_host         = (known after apply)
+       primary_file_endpoint              = (known after apply)
+       primary_file_host                  = (known after apply)
+       primary_file_internet_endpoint     = (known after apply)
+       primary_file_internet_host         = (known after apply)
+       primary_file_microsoft_endpoint    = (known after apply)
+       primary_file_microsoft_host        = (known after apply)
+       primary_location                   = (known after apply)
+       primary_queue_endpoint             = (known after apply)
+       primary_queue_host                 = (known after apply)
+       primary_queue_microsoft_endpoint   = (known after apply)
+       primary_queue_microsoft_host       = (known after apply)
+       primary_table_endpoint             = (known after apply)
+       primary_table_host                 = (known after apply)
+       primary_table_microsoft_endpoint   = (known after apply)
+       primary_table_microsoft_host       = (known after apply)
+       primary_web_endpoint               = (known after apply)
+       primary_web_host                   = (known after apply)
+       primary_web_internet_endpoint      = (known after apply)
+       primary_web_internet_host          = (known after apply)
+       primary_web_microsoft_endpoint     = (known after apply)
+       primary_web_microsoft_host         = (known after apply)
+       public_network_access_enabled      = true
+       queue_encryption_key_type          = "*******"
+       resource_group_name                = "rg-openmrscore-dev"
+       secondary_access_key               = (sensitive value)
+       secondary_blob_connection_string   = (sensitive value)
+       secondary_blob_endpoint            = (known after apply)
+       secondary_blob_host                = (known after apply)
+       secondary_blob_internet_endpoint   = (known after apply)
+       secondary_blob_internet_host       = (known after apply)
+       secondary_blob_microsoft_endpoint  = (known after apply)
+       secondary_blob_microsoft_host      = (known after apply)
+       secondary_connection_string        = (sensitive value)
+       secondary_dfs_endpoint             = (known after apply)
+       secondary_dfs_host                 = (known after apply)
+       secondary_dfs_internet_endpoint    = (known after apply)
+       secondary_dfs_internet_host        = (known after apply)
+       secondary_dfs_microsoft_endpoint   = (known after apply)
+       secondary_dfs_microsoft_host       = (known after apply)
+       secondary_file_endpoint            = (known after apply)
+       secondary_file_host                = (known after apply)
+       secondary_file_internet_endpoint   = (known after apply)
+       secondary_file_internet_host       = (known after apply)
+       secondary_file_microsoft_endpoint  = (known after apply)
+       secondary_file_microsoft_host      = (known after apply)
+       secondary_location                 = (known after apply)
+       secondary_queue_endpoint           = (known after apply)
+       secondary_queue_host               = (known after apply)
+       secondary_queue_microsoft_endpoint = (known after apply)
+       secondary_queue_microsoft_host     = (known after apply)
+       secondary_table_endpoint           = (known after apply)
+       secondary_table_host               = (known after apply)
+       secondary_table_microsoft_endpoint = (known after apply)
+       secondary_table_microsoft_host     = (known after apply)
+       secondary_web_endpoint             = (known after apply)
+       secondary_web_host                 = (known after apply)
+       secondary_web_internet_endpoint    = (known after apply)
+       secondary_web_internet_host        = (known after apply)
+       secondary_web_microsoft_endpoint   = (known after apply)
+       secondary_web_microsoft_host       = (known after apply)
+       sftp_enabled                       = false
+       shared_access_key_enabled          = true
+       table_encryption_key_type          = "*******"
+       tags                               = {
+           "environment"  = "dev"
+           "organization" = "audioprothese"
+           "project"      = "openmrs"
        }

+       blob_properties (known after apply)

+       network_rules (known after apply)

+       queue_properties (known after apply)

+       routing (known after apply)

+       share_properties (known after apply)

+       static_website (known after apply)
    }

  # azurerm_storage_container.chunks will be created
+   resource "azurerm_storage_container" "chunks" {
+       container_access_type             = "private"
+       default_encryption_scope          = (known after apply)
+       encryption_scope_override_enabled = true
+       has_immutability_policy           = (known after apply)
+       has_legal_hold                    = (known after apply)
+       id                                = (known after apply)
+       metadata                          = (known after apply)
+       name                              = "chunks"
+       resource_manager_id               = (known after apply)
+       storage_account_id                = (known after apply)
    }

  # azurerm_storage_container.ruler will be created
+   resource "azurerm_storage_container" "ruler" {
+       container_access_type             = "private"
+       default_encryption_scope          = (known after apply)
+       encryption_scope_override_enabled = true
+       has_immutability_policy           = (known after apply)
+       has_legal_hold                    = (known after apply)
+       id                                = (known after apply)
+       metadata                          = (known after apply)
+       name                              = "ruler"
+       resource_manager_id               = (known after apply)
+       storage_account_id                = (known after apply)
    }

  # helm_release.loki will be created
+   resource "helm_release" "loki" {
+       atomic                     = false
+       chart                      = "loki"
+       cleanup_on_fail            = false
+       create_namespace           = true
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "loki"
+       namespace                  = "loki"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://grafana.github.io/helm-charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           null,
        ]
+       verify                     = false
+       version                    = "6.29.0"
+       wait                       = true
+       wait_for_jobs              = false
    }

Plan: 7 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Create Terraform plan (DEV) #67](https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/14991908248)